Autodesk.Revit.DB.Structure.RebarBarType.CreateDefaultRebarBarType(Autodesk.Revit.DB.Document)
Creates a new RebarBarType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarBarType.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.RebarBarType.Create(Autodesk.Revit.DB.Document)
Creates a new RebarBarType object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.SetHookOffsetLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook offset length for a hook type
Remarks:
AutoCalcHookLengths is ignored when this property is set
hookId:
id of the hook type
newLength:
The hook offset length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
-or-
the hook specified by id hookId doesn't have valid offset length
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.GetHookOffsetLength(Autodesk.Revit.DB.ElementId)
Identifies the hook offset length for a hook type
Remarks:
If the AutoCalcHookLengths property is turned off, the default hook offset length will be returned
hookId:
id of the hook type
Returns:
The hook offset length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
-or-
the hook specified by id hookId doesn't have valid offset length
-or-
The element hookId does not exist in the document containing this RebarBarType
-or-
the hook specified by id hookId doesn't have valid default offset length
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing this RebarBarType is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The element is a member of a loaded family.
-or-
The element is a member of a group type that is
not being edited.
-or-
hookId is a member of a loaded family.
-or-
hookId is a member of a group type that is
not being edited.

Autodesk.Revit.DB.Structure.RebarBarType.SetHookTangentLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook tangent length for a hook type
Remarks:
AutoCalcHookLengths is ignored when this property is set
hookId:
id of the hook type
newLength:
The hook tangent length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.RebarBarType.GetHookTangentLength(Autodesk.Revit.DB.ElementId)
Identifies the hook tangent length for a hook type
hookId:
id of the hook type
Returns:
The hook tangent length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarBarType.SetHookLength(Autodesk.Revit.DB.ElementId,System.Double)
Identifies the hook length for a hook type
hookId:
id of the hook type
hookLength:
The hook length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.GetHookLength(Autodesk.Revit.DB.ElementId)
Identifies the hook length for a hook type
Remarks:
If the AutoCalcHookLengths property is turned off, the default hook length will be returned
hookId:
id of the hook type
Returns:
The hook length for a hook type
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarBarType.SetAutoCalcHookLengths(Autodesk.Revit.DB.ElementId,System.Boolean)
Identifies if the hook lengths of a hook type are automatically calculated for this bar type
hookId:
id of the hook type
autoCalculated:
True if the hook lengths should be automatically calculated, otherwise false
When it is false, default hook length and default hook offset length will be reported
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalcHookLengths(Autodesk.Revit.DB.ElementId)
Identifies if the hook lengths of a hook type are automatically calculated for this bar type
hookId:
id of the hook type
Returns:
True if the hook lengths are automatically calculated, otherwise false
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarBarType.SetHookPermission(Autodesk.Revit.DB.ElementId,System.Boolean)
Identifies if a hook type is permitted for this bar type
hookId:
id of the hook type
permission:
True if the hook type should be permitted for this bar type, otherwise false
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.GetHookPermission(Autodesk.Revit.DB.ElementId)
Identifies if a hook type is permitted for this bar type
hookId:
id of the hook type
Returns:
True if the hook type is permitted for this bar type, otherwise false
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarBarType.SetBarTypeDiameters(Autodesk.Revit.DB.BarTypeDiameterOptions)
Sets all input diameters from diametersOptions in current RebarBarType.
diametersOptions:
The input diameters are validated as follows :
barDiameter is both positive and no more than the smallest value of 1.0 and the input bend diameters.
Each bend diameter is smaller than 99.0 and bigger than barDiameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the diameters ranges in diametersOptions  are not acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018.1

Autodesk.Revit.DB.Structure.RebarBarType.BarDiameter
Defines bar diameter of rebar
The bar diameter of rebar
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bar diameter barDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter,
standard hook bend diameter and stirrup/tie bend diameter
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.StirrupTieBendDiameter
Defines bar and hook bend diameter for rebar whose style is stirrup/tie
The bar and hook bend diameter for rebar whose style is stirrup/tie
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.StandardHookBendDiameter
Defines hook bend diameter for rebar whose style is standard
The hook bend diameter for rebar whose style is standard
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bend diameter standardHookBendDiam isn't between bar diameter and 99.0
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.StandardBendDiameter
Defines bar bend diameter for rebar whose style is standard
The bar bend diameter for rebar whose style is standard
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bend diameter standardBendDiam isn't between bar diameter and 99.0
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.DeformationType
Defines bar deformation type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType.MaximumBendRadius
Defines maximum bend radius of rebar
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for maximumBendRadius is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: maximumBendRadius must be greater than 0 and no more than 30000.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarBarType
A Rebar type object that is used in the generation of Rebar